{
  "navbar": {
    "home": "home",
    "about": "about me",
    "skills": "skills",
    "projects": "projects",
    "contact": "contact"
  },
  "home": {
    "title": "portfolio",
    "hi": "Vitor Butkus",
    "name": "Butkus",
    "subtitle": "front-end webdev",
    "text": "I can turn your ideas into reality by using the most modern and uptodate programming skills"
  },
  "about": {
    "title": "About me",
    "subtitle": "who am I",
    "small": "To begin the self-description is the hardest part...",
    "p1": "My basic training is in Visual Arts. I have a degree and a master's degree in Visual Arts (with focus on Art History) from the Federal University of Rio Grande do Sul. I have worked as an artist, curator and researcher in museums, galleries and other institutions.",
    "p2": "For a few years now, my insatiable desire to learn new skills and techniques of visual expression has led me to the area of web development. I've already taken several courses, and in each of them I've been trying to develop personal projects to apply the mastered skills.",
    "p3": "I really enjoy learning new languages, and very recently I learned to communicate in Mandarin Chinese. Currently, I keep developing new skills in front-end, at the same time that little by little I seek to expand my knowledge in back-end.",
    "link": "Take a look at my my latest projects"
  },
  "skills": {
    "title": "skills",
    "subtitle": "what I can do"
  },
  "projects": {
    "title": "projects",
    "subtitle": "what I've been doing",
    "more": "See more",
    "blog": {
      "title": "Collective Blog",
      "text": "This project consists of the structure of a blog or digital magazine. Nowadays, many clients want to edit the contents of their websites themselves. Therefore, I built this structure where the logged in person can add, edit and remove posts. This feature can make life easier for customers who don't want to depend on the developer to manage the content of their websites."
    }
  },
  "contact": {
    "title": "contact",
    "subtitle": "how to find me",
    "name": "Vitor Butkus",
    "position": "front-end webdev",
    "text": "I don't usually show my personal life on social networks, but I believe that they are a very important means of socializing through the exchange of knowledge.",
    "connect": "connect with me"
  }
}
