{
  "navbar": {
    "home": "home",
    "about": "about",
    "skills": "skills",
    "projects": "projects",
    "authorial": "authorial",
    "commissioned": "commissioned",
    "contact": "contact"
  },
  "home": {
    "title": "portfolio",
    "hi": "Vitor Butkus",
    "name": "Butkus",
    "subtitle": "front-end webdeveloper",
    "text": "I can turn your ideas into reality by using the most modern and up-to-date programming skills"
  },
  "about": {
    "title": "About",
    "subtitle": "who am I",
    "small": "To begin the self-description is the hardest part...",
    "p1": "My basic training is in Visual Arts. I have a degree and a master's degree in Visual Arts (with focus on Art History) from the Federal University of Rio Grande do Sul. I have worked as an artist, curator and researcher in museums, galleries and other institutions.",
    "p2": "For a few years now, my insatiable desire to learn new skills and techniques of visual expression has led me to the area of web development. I've already taken several courses, and in each of them I've been trying to develop personal projects to apply the mastered skills.",
    "p3": "I really enjoy learning new languages, and very recently I learned to communicate in Mandarin Chinese. Currently, I keep developing new skills in front-end, at the same time that little by little I seek to expand my knowledge in back-end.",
    "link": "Take a look at my latest projects"
  },
  "skills": {
    "title": "skills",
    "subtitle": "what I can do"
  },
  "projects": {
    "title": "projects",
    "subtitle": "what I've been doing",
    "more": "See more",
    "authorial": {
      "title": "authorial projects",
      "subtitle": "what I've been doing",
      "blog": {
        "title": "Collective Blog / Digital Magazine",
        "text": "This project is the structure of a blog or digital magazine. Nowadays, many clients want to edit the contents of their websites themselves. Therefore, I've built this structure where the logged in person can add, edit and remove posts. This feature can make life easier for customers who don't want to depend on the developer to manage the content of their websites."
      },
      "hanzi": {
        "title": "Hanzi Draw",
        "text": "This is a web application to practice manual writing of hanzi (Chinese characters). The user can input any Chinese character and practice writing it using a mouse pointer, touch, or trackpad. There is also an option to choose character lists according to the language learner's proficiency level. The drawing happens smoothly and with pressure sensitivity, promoting enjoyment and creativity during learning."
      },
      "square": {
        "title": "Square Wave - business website template",
        "text": "Company or project website. Every time the user navigates from one page to another, it's done through an animation of the page elements. Both the form and content of the site (a fictional design company called Square Wave) were based on the square geometric shape."
      }
    },
    "commissioned": {
      "title": "commissioned projects",
      "subtitle": "what I've been doing for other people",
      "donada": {
        "title": "From nothing to pre-existing",
        "text": "'From nothing to pre-existing' is a multimedia artwork by artist Pedro Victor Brandão. I was responsible for adding interactivity to six series of images, turning them into six animations that respond to touch or mouse pointer."
      },
      "moreabstract": {
        "title": "More Abstract",
        "text": "Website of the art exhibition 'More Abstract', by the artist Pedro Victor Brandão, held at the Portas Vilaseca gallery in Rio de Janeiro in 2023. In addition to featuring images of the physical gallery, the website includes the digital versions of the artworks presented there. These works have also been published as non-fungible tokens and can be purchased directly through this website."
      },
      "cabanagem200": {
        "title": "cabanagem200.net",
        "text": "cabanagem200 is a website that permanently showcases files from the collection of works Nheenga Cabana, created in 2022 by artists Giseli Vasconcelos and Pedro Victor Brandão. The site serves as a digital archive for the texts, images, and news generated within the scope of the project, commissioned by MAM-Rio."
      }
    }
  },
  "contact": {
    "title": "contact",
    "subtitle": "how to find me",
    "name": "Vitor Butkus",
    "position": "front-end webdeveloper",
    "text": "I don't usually show my personal life on social networks, but I believe that they are a very important means of socializing through the exchange of knowledge.",
    "connect": "connect with me",
    "label-name": "name",
    "label-phone": "phone",
    "label-email": "e-mail",
    "label-subject": "subject",
    "label-message": "message",
    "button": "send",
    "success-message": "Great! Your message has been sent to my email. I will answer as soon as possible.",
    "error-message": "There was an error sending your message. You can contact me directly through the channels listed in the CONTACT tab."
  }
}
