{
  "blog": {
    "title": "Collective Blog / Digital Magazine",
    "small": "Project",
    "summary": "Summary",
    "summary-content": "Blog structure built from scratch using Next.js 13 and Tailwind CSS.",
    "description": "Description",
    "description-p1": "This project consists of a blog or magazine that can be updated by creating new posts. Users can create a username and password. The editing feature present in this project was motivated by the demand of a client who expressed the need to be able to edit and publish his own content. Only logged in users can modify the content of the platform. The solution I created even makes it possible for a group of people to maintain the site's content collectively.",
    "description-p2": "Once logged in, users can create new posts, edit existing posts and delete posts. On the post editing/creation page, the user can use the Markdown language to format the texts. It is also possible to add images to posts. Markdown is an easy-to-learn language for users with little or no technical knowledge. With it, you can easily add highlighted headings, numbered lists, italics, bold, and other formatting. There are some posts on the blog itself that explain how to use this feature.",
    "technical": "Technical Specifications",
    "technical-p1": "The project was written in React 18 syntax, using the Next.js 13 routing framework.",
    "technical-p2": "For the styles, Tailwind CSS integrated with Next.js was used. The page is fully responsive, and all elements can be viewed on devices such as computers, cell phones and tablets. The homepage header contains animations powered by React Framer Motion.",
    "technical-p3": "For real-time data storage, Firebase Firestore was used. For storing users and authentication data, Firebase Auth was used. This way, data added by users persists and can be accessed from any device.",
    "technical-p4": "The routes that lead to the creation of new posts and editing the content of existing posts are protected in two ways: client-side, the application directs non-logged-in users to the login page; server-side, the database only accepts GET requests from non-logged in users, and POST request will be denied. Thus, non-logged in users can read the content of posts, but cannot edit the content. In a production context, links and routes for editing content can be protected, guaranteeing access only to blog/magazine editors.",
    "technical-p5": "Therefore, this solution combines the best of both worlds: on the one hand, there is the speed of an application made in React/Next.js; on the other hand, there is the interactivity and ease of feeding existing content on websites hosted on platforms such as Wordpress, Wix, etc. - and without the need to pay for these services.",
    "demo": "demo",
    "code": "code"
  },
  "donada": {
    "title": "From Nothing to Pre-existing",
    "small": "Project",
    "summary": "Summary",
    "summary-content": "Creation of script for artwork interactivity.",
    "description": "Description",
    "description-p1": "The series 'From Nothing to Pre-Existing' by contemporary Brazilian artist Pedro Victor Brandão consists of 6 sets of images that depict photochemical processes generated by the interaction of chemical reagents with photographic paper. The images gradually record the chemical reactions triggered by the artist in his material, resulting in an abstract composition.",
    "description-p2": "My task here was to create a JavaScript programming script that would animate these static sets of images, making them responsive to touch (on touch screen devices) or mouse pointer (on desktop devices). The user interacts with the artwork by touching/hovering over the composition, gradually revealing the steps of the image creation process, up to the final result.",
    "description-p3": "One of the pieces from the 'From Nothing to Pre-existing' series was featured in the group exhibition 'Emoção de lidar / The Emotion of Dealing' (2023), at Quadra Galeria, in São Paulo. The six works were also published as non-fungible tokens (NFT) for the purpose of sale and permanent documentation.",
    "technical": "Technical Specifications",
    "technical-p1": "To bring the static images to life, I generated a basic structure of HTML, CSS, and JavaScript. The HTML provides the semantic structure of the markup. The CSS simply ensures the responsiveness of the animation on devices with screens of different formats and sizes.",
    "technical-p2": "The Vanilla JavaScript script is what actually enables the user interaction with the artwork. Whether through touch or mouse pointer, the user can activate the frame-by-frame animation of the images at the speed established by the movement of the finger or mouse on the X (horizontal) axis of the image. The animation can be played forward and backward as many times as the user desires.",
    "technical-p3": "Upon entering the page, a loading bar will indicate the progress of loading the images. By the choice of the artist who commissioned this project, the images are in high resolution (about 3000px in height), and therefore the loading indicator is necessary for a satisfactory user experience. When the user removes their finger/mouse pointer from the image area, an SVG icon is displayed showing a hand and the action of lateral scrolling (swipe), indicating the way to interact with the artwork. This icon also appears as soon as all images are loaded, indicating that the application is ready for interaction.",
    "technical-p4": "The code should be as lightweight as possible, as the goal is to publish it on a blockchain-based storage and permanent registry service.",
    "technical-p5": " ",
    "demo": "artwork",
    "code": "code"
  },
  "hanzi": {
    "title": "Hanzi Draw",
    "small": "Project",
    "summary": "Summary",
    "summary-content": "Web application for practicing the manual writing of Chinese characters (hanzi).",
    "description": "Description",
    "description-p1": "This is an online tool I created for drawing Chinese characters (hanzi). It allows users to practice and improve their Chinese writing skills by tracing the characters with the mouse or finger (on mobile devices).",
    "description-p2": "Upon opening the website, users are presented with a text input field where they can type in the Chinese character they wish to practice. Once the character is typed in, the user can click on 'Draw' and begin practicing writing the character. The user can see the stroke order of the character and follow the path with the mouse or finger, tracing the character on the screen.",
    "description-p3": "The site also allows users to customize the appearance of the character by choosing the color and size of the brush, as well as the stroke style.",
    "description-p4": "To further aid in the learning of new vocabulary, users can also be guided in their study through vocabulary lists. There are lists, for example, of animals, numbers, leisure activities, business, and also vocabulary lists classified by the student's proficiency level (HSK).",
    "description-p5": "The website is simple and intuitive, with a clean and user-friendly interface. It's a great tool for those who are learning Chinese or for those who want to practice writing Chinese characters in a fun and interactive way.",
    "technical": "Technical Specifications",
    "technical-p1": "The project was written in React 18 syntax, using the routing framework of Next.js 13.",
    "technical-p2": "In addition, dependencies loaded from the NPM repository were used, such as hanzi-write, perfect-freehand, and react-icons.",
    "technical-p3": "The website is fully responsive, providing a great experience for users on desktop, mobile, or tablet.",
    "technical-p4": "Soon, I plan to add the login feature, so that users can create a personal account, favorite their favorite character lists, save drawings, and more.",
    "technical-p5": " ",
    "demo": "website",
    "code": "code"
  },
  "moreabstract": {
    "title": "More Abstract",
    "small": "Project",
    "summary": "Summary",
    "summary-content": "This is a website showcasing the exhibition 'More Abstract / Mais abstratas' by artist Pedro Victor Brandão, held at Galeria Portas Vilaseca, featuring digital versions of the works.",
    "description": "Description",
    "description-p1": "The website www.moreabstract.xyz showcases the exhibition 'More Abstract', by Pedro Victor Brandão. The exhibition was held at the Portas Vilaseca art gallery in Rio de Janeiro in 2023. The website development was commissioned by the gallery and carried out by me.",
    "description-p2": "The idea of the website is not to replace a visit to the gallery, but to add an extra layer to the visit. On the website, visitors can see the digital versions of the artworks presented in the gallery. These artworks have been published as non-fungible tokens (NFTs), and the website ensures visitors have permanent access to them.",
    "description-p3": "In addition to getting to know and enjoy the artist's abstract and conceptual works, with access to the complete technical specifications and images of each work, visitors can also purchase the works through the website. All they have to do is connect their digital cryptocurrency wallet and make the transaction. In the case of one of the series of works ('View to nothingness'), when purchasing the digital copy, the visitor is entitled to a physical copy of the work.",
    "description-p4": "Cryptocurrency transactions are still not well-known to the general public. Therefore, the website also contains an FAQ (Frequently Asked Questions) section, containing a series of explanations about the concepts that govern the so-called Web3, non-fungible tokens, and cryptocurrencies. This section also addresses the issue of the authenticity of digital works, to better guide potential buyers.",
    "description-p5": "The website design is minimalist and intuitive, with a clean and user-friendly interface. It was created to appeal to both visitors interested in the artist's work, as well as collectors, investors, and other potential buyers and clients of the gallery.",
    "technical": "Technical Specifications",
    "technical-p1": "The project was written in the React 18 syntax, using the Next.js 13 route structure.",
    "technical-p2": "For the interfaces of interaction with non-fungible tokens, widgets provided by the Manifold platform were used. These widgets, when imported into a React website, make requests to the Manifold API to populate the technical specifications and images of the works with the data of each item. At the time of the development of this website, this feature had just been made available by Manifold - which made me have to contact the developers of the team to solve some errors that still existed in their implementation. It was a great learning experience for me, and I am pleased to have contributed to the ecosystem of that platform in this way.",
    "technical-p3": "The website is fully responsive, providing a great experience for users on desktop, mobile, or tablet.",
    "technical-p4": "The introductory text and the FAQ section are available in a bilingual Portuguese-English version, provided through the 'next-i18next' dependency. The moreabstract.xyz domain was purchased and set up via Google Domains and Vercel.",
    "technical-p5": " ",
    "demo": "website",
    "code": "code"
  },
  "square": {
    "title": "Square Wave - Company Website Template",
    "small": "Project",
    "summary": "Summary",
    "summary-content": "Company website template with animated page elements during navigation.",
    "description": "Description",
    "description-p1": "This is a template I created to serve as the basis for a company or project website. When accessing the website address, the navigation menu is loaded with an animation that forms the final image of a square made up of several squares in less than a second.",
    "description-p2": "Some of these smaller squares are links to secondary pages, which contain information such as project/company description, team, contact, etc. To populate the website, I imagined a fictional design company, with a team and proposals for action.",
    "description-p3": "This is just one of many possibilities for a website containing animations, and both the form and content can be adapted as needed.",
    "technical": "Technical Specifications",
    "technical-p1": "The website features animations of elements triggered by navigation. The entire template is optimized for optimal performance and good responsiveness on desktop, tablet, or mobile.",
    "technical-p2": "The website has a minimalist style and the animations give it a fluid and relaxed feel. The animations are done using Framer Motion.",
    "technical-p3": "The website structure was written in Next.js 13, built on React 18. The font used was loaded from the Google Fonts repository.",
    "demo": "demo",
    "code": "código"
  },
  "contact": {
    "label-name": "name",
    "label-phone": "phone",
    "label-email": "e-mail",
    "label-subject": "subject",
    "label-message": "message",
    "button": "enviar"
  }
}
