{
  "navbar": {
    "home": "início",
    "about": "sobre mim",
    "skills": "habilidades",
    "projects": "projetos",
    "authorial": "autorais",
    "commissioned": "comissionados",
    "contact": "contato"
  },
  "home": {
    "title": "portfólio",
    "hi": "Vitor Butkus",
    "name": "Butkus",
    "subtitle": "desenvolvedor front-end",
    "text": "Posso transformar suas ideias em realidade usando as habilidades de programação mais modernas e atualizadas"
  },
  "about": {
    "title": "sobre mim",
    "subtitle": "quem sou eu",
    "small": "Começar a auto-apresentação é a parte mais difícil...",
    "p1": "Minha formação de base são as Artes Visuais. Tenho graduação e mestrado em Artes Visuais (habilitação em História da Arte) pela Universidade Federal do Rio Grande do Sul. Já atuei como artista, curador e pesquisador em museus, galerias e outras instituições.",
    "p2": "De uns anos pra cá, minha vontade insaciável de aprender novas habilidades e técnicas de expressão visual tem me levado para a área do desenvolvimento web. Já realizei vários cursos, e a cada um deles tenho buscado elaborar projetos pessoais para aplicar as habilidades dominadas.",
    "p3": "Gosto de aprender novas línguas, e muito recentemente aprendi a me comunicar em chinês mandarim. Atualmente, continuo desenvolvendo novas habilidades em front-end, ao mesmo tempo em que pouco a pouco busco ampliar meus conhecimentos em back-end.",
    "link": "Dê uma olhada nos meus projetos mais recentes"
  },
  "skills": {
    "title": "habilidades",
    "subtitle": "o que sei"
  },
  "projects": {
    "title": "projetos",
    "subtitle": "o que tenho feito",
    "more": "Ver mais",
    "authorial": {
      "title": "projetos autorais",
      "subtitle": "o que tenho feito de forma independente",
      "blog": {
        "title": "Blog Coletivo / Revista Digital",
        "text": "Este projeto consiste na estrutura de um blog ou revista digital. Hoje em dia, muitos clientes desejam eles mesmos editar os conteúdos de seus sites. Por isso, construí essa estrutura onde a pessoa logada pode adicionar, editar e remover postagens. Esse recurso pode facilitar a vida de clientes que não querem depender do desenvolvedor para gerenciar o conteúdo dos seus websites."
      },
      "hanzi": {
        "title": "Hanzi Draw",
        "text": "Uma aplicação web para treinar a escrita manual de hanzi (caracteres chineses). A pessoa usuária pode inserir qualquer caractere chinês e praticar a escrita usando o ponteiro do mouse, o toque ou o trackpad. Há ainda a opção de escolher listas de caracteres conforme o nível de proficiência do estudante de línguas. O desenho acontece de forma fluida e com sensibilidade à pressão, favorecendo o prazer e a criatividade durante o aprendizado."
      }
    },

    "commissioned": {
      "title": "projetos comissionados",
      "subtitle": "o que tenho feito para outras pessoas",
      "donada": {
        "title": "Do nada ao pré-existente",
        "text": "'Do nada ao pré-existente' é uma obra de arte multimídia do artista Pedro Victor Brandão. Fui responsável por agregar interatividade a seis séries de imagens, transformando-as em seis animações que respondem ao toque ou ponteiro do mouse."
      },
      "moreabstract": {
        "title": "More Abstract",
        "text": "Website da exposição 'More abstract / Mais abstratas', do artista Pedro Victor Brandão, realizada na galeria Portas Vilaseca, no Rio de Janeiro, em 2023. Além de trazer imagens da galeria física, o website contém a versão digital das obras apresentadas lá. Essas obras também foram publicadas em versão digital como tokens não-fungíveis, e podem ser compradas diretamente através desse website."
      }
    }
  },
  "contact": {
    "title": "contato",
    "subtitle": "onde me encontrar",
    "name": "Vitor Butkus",
    "position": "desenvolvedor front-end",
    "text": "Eu não costumo mostrar minha vida pessoal nas redes sociais, mas acredito que elas são um meio muito importante de socializar através da troca de conhecimentos.",
    "connect": "conecte-se comigo",
    "label-name": "nome",
    "label-phone": "celular",
    "label-email": "e-mail",
    "label-subject": "assunto",
    "label-message": "mensagem",
    "button": "enviar",
    "success-message": "Pronto! Sua mensagem foi enviada para o meu e-mail. Vou respondê-la o mais breve possível.",
    "error-message": "Houve um erro no envio da sua mensagem. Você pode entrar em contato diretamente comigo pelos canais na aba CONTATO."
  }
}
