{
  "common": {
    "technologies": "Tecnologias",
    "back": "voltar"
  },
  "blog": {
    "title": "Blog Coletivo / Revista Digital",
    "small": "Projeto",
    "summary": "Resumo",
    "summary-content": "Estrutura de blog construída do zero usando Next.js 13 e Tailwind CSS.",
    "description": "Descrição",
    "description-p1": "Este projeto consiste em um blog ou revista que pode ser atualizado pela criação de novos posts. O recurso de edição presente neste projeto foi motivado pela demanda de um cliente que expressou a necessidade de poder editar e publicar o seu próprio conteúdo. Apenas usuáries logades podem modificar o conteúdo da plataforma. A solução que criei possibilita, inclusive, que a manutenção do conteúdo do site seja feita por um grupo de pessoas, de forma coletiva.",
    "description-p2": "As pessoas usuárias podem criar um nome de usuárie e senha. Estando logadas, podem criar novos posts, editar os posts já existentes e deletar posts. Na página de edição/criação de posts, a pessoa usuária pode usar a linguagem Markdown para formatar os textos. Também é possível adicionar imagens aos posts. Markdown é uma linguagem fácil de aprender para usuáries com pouco ou nenhum conhecimento técnico. Com ela, pode-se facilmente adicionar títulos em destaque, listas numeradas, itálico, negrito e outras formatações. Para facilitar, criei alguns posts no próprio blog que explicam como usar esse recurso.",
    "technical": "Especificações Técnicas",
    "technical-p1": "O projeto foi escrito na sintaxe do React 18, usando a estrutura de rotas do Next.js 13.",
    "technical-p2": "Para os estilos, foi usado o Tailwind CSS integrado ao Next.js. A página é totalmente responsiva, e todos os elementos podem ser visualizados em dispositivos como computadores, celulares e tablets. O header da página inicial contém animações ativadas por React Framer Motion.",
    "technical-p3": "Para o armazenamento em tempo real de dados, foi usado Firebase Firestore. Para o armazenamento dos usuários e dados de autenticação, foi usado Firebase Auth. Dessa forma, os dados adicionados pelos usuários persistem e podem ser acessados de qualquer dispositivo.",
    "technical-p4": "As rotas que levam à criação de novos posts e edição do conteúdo dos posts existentes são protegidas de duas formas: client-side, a aplicação direciona usuários não-logados para a página de login; server-side, o banco de dados só aceita requisições do tipo GET de usuários não-logados. Assim, os usuários não-logados podem ler o conteúdo dos posts, mas não podem editar o conteúdo. Num contexto de produção, os links e rotas para a edição de conteúdo pode ser protegida, garantindo-se o acesso apenas para os editores do blog/revista.",
    "technical-p5": "Dessa forma, essa solução une o melhor de dois mundos: por um lado, há a rapidez de uma aplicação feita em React/Next.js; por outro lado, há a interatividade e facilidade de alimentação de conteúdo existente nos websites hospedados em plataformas como Wordpress, Wix, etc. - e sem a necessidade de pagamento por esses serviços.",
    "demo": "demo",
    "code": "código"
  },
  "donada": {
    "title": "Do nada ao pré-existente",
    "small": "Projeto",
    "summary": "Resumo",
    "summary-content": "Criação de script para interatividade de obra de arte.",
    "description": "Descrição",
    "description-p1": "A série 'Do nada ao pré-existente' do artista contemporâneo brasileiro Pedro Victor Brandão consiste em 6 sets de imagens que retratam processos fotoquímicos gerados pela interação de reagentes com papel fotográfico. As imagens registram gradualmente as reações químicas disparadas pelo artista em seu material de trabalho, gerando finalmente uma composição abstrata.",
    "description-p2": "A minha tarefa aqui foi, partindo desses sets de imagens estáticas, gerar um script de programação JavaScript que os tornasse animados, reagindo ao toque (em dispositivos com tela touch) ou ao ponteiro do mouse (em dispositivos desktop). A pessoa usuária interage com a obra ao tocar/passar o mouse sobre a composição, revelando gradualmente os passos do processo de criação da imagem, até o resultado final.",
    "description-p3": "Um dos itens da série 'Do nada ao pré-existente' esteve na exposição coletiva 'Emoção de lidar' (2023), na Quadra Galeria, em São Paulo. As seis obras também publicadas como tokens não-fungíveis (NFT) para fins de venda e documentação permanente.",
    "technical": "Especificações Técnicas",
    "technical-p1": "Para dar vida às imagens estáticas, gerei uma estrutura básica de HTML, CSS e JavaScript. O HTML serve para prover a estrutura semântica do markup. O CSS serve simplesmente para garantir a responsividade da animação em dispositivos com telas de diferentes formatos e tamanhos.",
    "technical-p2": "O script em Vanilla JavaScript é o que, de fato, garante a interação da pessoa usuária com a obra. Seja através do toque ou do ponteiro do mouse, a pessoa usuária pode ativar a animação frame a frame das imagens, na velocidade estabelecida pela rapidez do movimento do dedo ou do mouse no eixo X (horizontal) da imagem. A animação pode ser avançada e retrocedida quantas vezes a pessoa usuária desejar.",
    "technical-p3": "Ao entrar na página, uma barra de carregamento vai indicar o progresso de carregamento das imagens. Por escolha do artista que comissionou esse projeto, as imagens estão em resolução alta (cerca de 3000px de altura), e por isso o indicador de carregamento é necessário para experiência satisfatória do usuário. Ao tirar o dedo/ponteiro do mouse da área da imagem, é mostrado um ícone em svg onde aparece uma mão e a ação de rolagem lateral (swipe), indicando a forma de interação com a obra. Esse ícone também aparece logo que todas as imagens são carregadas, indicando que a aplicação está pronta para a interação.",
    "technical-p4": "O código deveria ser o mais leve possível, já que o objetivo seria publicá-lo em um serviço de armazenamento e registro permanente na blockchain.",
    "technical-p5": " ",
    "demo": "obra",
    "code": "código"
  },
  "hanzi": {
    "title": "Hanzi Draw",
    "small": "Projeto",
    "summary": "Resumo",
    "summary-content": "Aplicação web para a prática da escrita manual de caracteres chineses (hanzi).",
    "description": "Descrição",
    "description-p1": "Esta é uma ferramenta online criada por mim para desenhar caracteres chineses (hanzi). Ele permite aos usuários praticar e melhorar suas habilidades de escrita chinesa, traçando os caracteres com o mouse ou com o dedo (em dispositivos móveis).",
    "description-p2": "Ao abrir o site, os usuários são apresentados a um campo de entrada de texto, onde eles podem digitar o caractere que desejam praticar. Uma vez digitado o caractere, o usuário pode clicar em 'Desenhar' e começar a praticar a escrita do caractere. O usuário pode ver a ordem dos traços do caractere e seguir o caminho com o mouse ou dedo, traçando o caractere na tela.",
    "description-p3": "O site também permite aos usuários personalizar a aparência do caractere, escolhendo a cor e o tamanho do pincel, assim como o estilo de traçado.",
    "description-p4": "Para ajudar ainda mais no aprendizado de novo vocabulário, os usuários também podem ser guiados no seu estudo por listas de vocabulários. Há listas, por exemplo, de animais, números, atividades de lazer, negócios, e também listas de vocabulários classificadas por nível de proficiência (HSK) do estudante.",
    "description-p5": "O website é simples e intuitivo, com uma interface de usuário limpa e fácil de usar. Ele é uma ótima ferramenta para aqueles que estão aprendendo chinês ou para aqueles que desejam praticar a escrita de caracteres chineses de uma maneira divertida e interativa.",
    "technical": "Especificações Técnicas",
    "technical-p1": "O projeto foi escrito na sintaxe do React 18, usando a estrutura de rotas do Next.js 13.",
    "technical-p2": "Além disso, foram usadas dependências carregadas do repositório NPM, tais como hanzi-write, perfect-freehand e react-icons.",
    "technical-p3": "O site é totalmente responsivo, podendo fornecer uma ótima experiência para usuários em desktop, mobile ou tablet.",
    "technical-p4": "Em breve, pretendo adicionar o recurso de login, dessa forma os usuários poderão criar uma conta pessoal, favoritar suas listas de caracteres preferidos, salvar desenhos, etc.",
    "technical-p5": " ",
    "demo": "demo",
    "code": "código"
  },
  "moreabstract": {
    "title": "More Abstract",
    "small": "Projeto",
    "summary": "Resumo",
    "summary-content": "Website da exposição 'More Abstract / Mais abstratas', do artista Pedro Victor Brandão (Galeria Portas Vilaseca), contendo as versões digitais das obras.",
    "description": "Descrição",
    "description-p1": "O site www.moreabstract.xyz apresenta a exposição More Abstract / Mais abstratas, de Pedro Victor Brandão. A exposição foi realizada na galeria de arte Portas Vilaseca, no Rio de Janeiro, em 2023. O desenvolvimento do site foi feito por mim e comissionado pela galeria.",
    "description-p2": "A ideia do site não é substituir uma visita à galeria, mas sim adicionar à visita uma camada a mais. No site, o visitante pode conhecer as versões digitais das obras apresentadas na galeria. Essas obras foram publicadas como tokens não-fungíveis (NFT), e o site garante o acesso permanente dos visitantes às mesmas.",
    "description-p3": "Além de conhecer e desfrutar dos trabalhos abstratos e conceituais do artista, com acesso à ficha técnica completa e imagens de cada um, o visitante pode também adquirir os trabalhos através do próprio site. Basta que o visitante conecte a sua carteira digital de criptomoedas e faça a transação. No caso de uma das séries de obras ('View to nothingness'), ao adquirir a cópia digital, o visitante tem direito a uma cópia física da obra.",
    "description-p4": "As transações em criptomoedas ainda não são muito conhecidas pelo grande público. Por isso, o site também contém uma seção de FAQ (Perguntas Frequentes), contendo uma série de explicações sobre os conceitos que regem a chamada Web3, os tokens não-fungíveis e as criptomoedas. Essa seção também aponta a questão da autenticidade das obras digitais, para melhor orientar os potenciais compradores.",
    "description-p5": "O design do website é minimalista e intuitivo, com uma interface de usuário limpa e fácil de usar. Foi pensado para agradar tanto aos visitantes interessados na obra do artista, quanto aos colecionadores, investidores e outros possíveis compradores e clientes da galeria.",
    "technical": "Especificações Técnicas",
    "technical-p1": "O projeto foi escrito na sintaxe do React 18, usando a estrutura de rotas do Next.js 13.",
    "technical-p2": "Para as interfaces de interação com os tokens não-fungíveis, foram usadas as widgets fornecidas pela plataforma Manifold. Essas widgets, ao serem importadas em um website React, fazem requisições ao API da Manifold para alimentar as fichas técnicas e imagens das obras com os dados de cada item. Na época do desenvolvimento deste site, esse recurso havia sido recém disponibilizado pela Manifold - o que me fez ter de entrar em contato com os desenvolvedores da equipe para solucionar alguns erros que ainda existiam na implementação deles. Foi um ótimo aprendizado para mim, e fico satisfeito de, dessa forma, ter contribuído também com o ecossistema daquela plataforma.",
    "technical-p3": "O site é totalmente responsivo, podendo fornecer uma ótima experiência para usuários em desktop, mobile ou tablet.",
    "technical-p4": "O texto introdutório e a seção FAQ estão em versão bilíngue português-inglês, fornecida através da dependência 'next-i18next'. O domínio moreabstract.xyz foi comprado e configurado via Google Domains e Vercel.",
    "technical-p5": " ",
    "demo": "site",
    "code": "código"
  },
  "cabanagem200": {
    "title": "cabanagem200.net",
    "small": "Projeto",
    "summary": "Resumo",
    "summary-content": "O site funciona como um arquivo digital para os textos, imagens e notícias gerados a partir do projeto Nheenga Cabana, reunindo metariais de referência sobre a Revolta da Cabanagem, insurreição popular ocorrida no Norte do Brasil no século XIX.",
    "description": "Descrição",
    "description-p1": "cabanagem200 é um site que mostra de forma permanente arquivos da instalação Nheenga Cabana, realizada em 2022 pelos artistas Giseli Vasconcelos e Pedro Victor Brandão. O projeto foi comissionado pelo MAM-Rio e foi parte da exposição Atos de Revolta: outros imaginários sobre a independência. O site funciona como um arquivo digital para os textos, imagens e notícias gerados no âmbito do projeto.",
    "description-p2": "A Revolta da Cabanagem foi uma insurreição popular ocorrida no século XIX durante o período monárquico no Brasil. Foi uma das principais revoltas populares brasileiras, mas permanece pouco documentada na historiografia. Os artistas Giseli Vasconcelos e Pedro Victor Brandão aproveitaram a data dos duzentos anos de independência do Brasil para tomar a Cabanagem como assunto do projeto de arte conceitual Nheenga Cabana, apresentado na exposição Atos de Revolta: outros imaginários sobre a independência, apresentada no MAM-Rio, com curadoria de Beatriz Lemos, Keyna Eleison, Pablo Lafuente e Thiago de Paula Souza.",
    "description-p3": "O site serve de arquivo permanente para o conjunto de materiais elaborados especialmente para a exposição. Esses materiais incluem: edição especial do Jornal Pessoal, com textos do pesquisador Lúcio Flávio Pinto; imagens geradas através de inteligência artificial, tendo como base os textos de Lúcio Flávio Pinto; imagens resultantes do processo de pesquisa dos artistas com as tecnologias de Machine Learning; os inputs de texto que geraram essas imagens; notícias publicadas por veículos de imprensa nacionais e internacionais a respeito do projeto.",
    "description-p4": "A maior parte do amplo conjunto de materiais apresentados pode ser acessada no página inicial do website, que está dividida em seções. Esse tipo de apresentação acompanha o visitante em um sobrevoo nesse vasto material. A pessoa usuária também tem acesso à versão PDF da publicação referente ao projeto, que pode ser baixada ou lida no próprio navegador. As imagens geradas por inteligência artificial podem ser vistas em detalhes através de lightboxes, onde a pessoa usuária pode dar zoom nas imagens.",
    "description-p5": "Para o design, optou-se pela simplicidade e o minimalismo, deixando o conteúdo de sobressair em relação à forma de apresentação. Foram adicionadas animações sutis, e cada decisão formal foi tomada a partir da discussão prévia com os autores do projeto.",
    "technical": "Especificações Técnicas",
    "technical-p1": "O projeto foi escrito na sintaxe do React 18, usando a estrutura de rotas do Next.js 13.",
    "technical-p2": "Foi usada a biblioteca Tailwind CSS para a estilização completa de cada um dos componentes do site, que foram construídos de forma customizada para o site.",
    "technical-p3": "O site é totalmente responsivo, podendo fornecer uma ótima experiência para usuários em desktop, mobile ou tablet. Todas as páginas têm versões dark mode e light mode, podendo ser ativadas através de um botão na barra de navegação.",
    "technical-p4": "",
    "demo": "site",
    "code": "código"
  },
  "square": {
    "title": "Square Wave - modelo de site de empresa",
    "small": "Projeto",
    "summary": "Resumo",
    "summary-content": "Modelo de site de empresa com animações dos elementos das páginas ao navegar.",
    "description": "Descrição",
    "description-p1": "Este é um modelo feito por mim para servir de base ao website de uma empresa ou projeto. Ao chegar no endereço do site, o menu de navegação é carregado com uma animação que, em menos de um segundo, forma a imagem definitiva de um quadrado formado por vários quadrados.",
    "description-p2": "Alguns desses quadrados menores são links para páginas secundárias, que contêm informações como definição do projeto/empresa, equipe, contato, etc. Para alimentar o site, imaginei uma empresa de design fictícia, com equipe e propostas de atuação.",
    "description-p3": "Essa é apenas uma entre muitas possibilidades de site contendo animações, e tanto a forma quanto o conteúdo podem ser adaptados conforme a necessidade.",
    "technical": "Especificações Técnicas",
    "technical-p1": "O site apresenta animações de elementos disparadas pela navegação. Toda a template é otimizada para uma performance ótima e boa responsividade, em desktop, tablet ou celular.",
    "technical-p2": "O site tem um estilo minimalista e as animações dão um ar fluido e descontraído. As animações são feitas através de Framer Motion.",
    "technical-p3": "A estrutura do site foi escrita em Next.js 13, sobre React 18. A fonte utilizada foi carregada do respositório Google Fonts.",
    "demo": "demo",
    "code": "código"
  }
}
